-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: webpos
-- ------------------------------------------------------
-- Server version	5.5.5-10.4.32-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `pedidos_detalle`
--

DROP TABLE IF EXISTS `pedidos_detalle`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `pedidos_detalle` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `id_cl` int(11) NOT NULL,
  `id_pedido` int(11) NOT NULL,
  `producto` varchar(45) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL,
  `cantidad` int(11) NOT NULL,
  `valor` int(11) NOT NULL,
  `estado` varchar(5) NOT NULL,
  `fecha_reg` date NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=181 DEFAULT CHARSET=utf8 COLLATE=utf8_spanish_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `pedidos_detalle`
--

LOCK TABLES `pedidos_detalle` WRITE;
/*!40000 ALTER TABLE `pedidos_detalle` DISABLE KEYS */;
INSERT INTO `pedidos_detalle` VALUES (12,1,7,'Cheetos',1,10580,'N','2024-12-04'),(13,1,7,'Galleta mini mckay',1,2700,'S','2024-12-04'),(14,1,7,'Galleta mini',1,2700,'S','2024-12-04'),(15,1,7,'Galleta Mini',1,2700,'S','2024-12-04'),(16,1,7,'Ramitas Evercrisp',1,9780,'S','2024-12-04'),(17,1,7,'Galletas mini Mckay',1,2700,'S','2024-12-04'),(18,1,7,'Papas fritas',1,11180,'S','2024-12-04'),(19,1,7,'Super 8',1,11900,'S','2024-12-04'),(20,1,7,'Doblón ',1,6280,'S','2024-12-04'),(21,1,7,'Bom Bom Bum',1,3180,'S','2024-12-04'),(22,1,7,'Sprite lata',1,8160,'S','2024-12-04'),(23,1,7,'Coca Cola',1,8160,'S','2024-12-04'),(24,1,7,'Chicle Grosso',1,1520,'S','2024-12-04'),(25,1,7,'Chicle Grosso',1,1520,'S','2024-12-04'),(26,1,7,'Kryzpo',1,3420,'S','2024-12-04'),(27,1,7,'Agua Mineral',1,8880,'S','2024-12-04'),(28,1,7,'Galleta Bañada',1,11380,'S','2024-12-04'),(29,1,7,'Kryzpo 2',1,3420,'S','2024-12-04'),(30,0,0,'',0,0,'','0000-00-00'),(31,1,8,'Crazy Chirimoya',1,11040,'S','2024-12-07'),(32,1,8,'Crazy Flocos',1,11040,'S','2024-12-07'),(33,1,8,'Crazy Frambuesa',1,11040,'S','2024-12-07'),(34,1,8,'Xplori',1,9528,'S','2024-12-07'),(35,1,8,'Centella',1,10296,'S','2024-12-07'),(36,1,8,'Egocéntrico',1,11780,'S','2024-12-07'),(37,1,8,'Crocanty',1,11780,'S','2024-12-07'),(38,1,8,'Chocolito',1,11780,'S','2024-12-07'),(39,1,8,'Lolly Pop',1,9940,'S','2024-12-07'),(40,1,9,'Cachantún Más',1,9900,'S','2024-12-14'),(41,1,9,'Bachata',1,6120,'S','2024-12-14'),(42,1,9,'Mentitas',1,3840,'S','2024-12-14'),(43,1,9,'Bon o Bon',1,20580,'S','2024-12-14'),(44,1,9,'Inkat',1,10800,'S','2024-12-14'),(45,1,9,'Mekano',1,15600,'S','2024-12-14'),(46,1,9,'Loly Choc',1,5120,'S','2024-12-14'),(47,1,9,'Golpe ',1,11400,'S','2024-12-14'),(48,1,10,'',0,0,'S','2024-12-14'),(49,1,9,'',0,0,'N','2024-12-14'),(50,1,11,'Cachantun',1,9900,'S','2024-12-14'),(51,1,11,'Bachata',1,6120,'S','2024-12-14'),(52,1,11,'Mentitas',1,3840,'S','2024-12-14'),(53,1,11,'Bon o bon',1,20580,'S','2024-12-14'),(54,1,11,'Inkat',1,10800,'S','2024-12-14'),(55,1,11,'Mekano',1,15600,'S','2024-12-14'),(56,1,11,'Loly choc',1,5120,'S','2024-12-14'),(57,1,11,'Golpe',1,11400,'S','2024-12-14'),(58,1,12,'Pepsi lata',1,5590,'S','2024-12-21'),(59,1,12,'Sprite lata',1,5890,'S','2024-12-21'),(60,1,12,'Coca lata',1,5890,'S','2024-12-21'),(61,1,12,'Ginger ale',1,4300,'S','2024-12-21'),(62,1,12,'Seven Up',1,5590,'S','2024-12-21'),(63,1,12,'',0,0,'N','2024-12-21'),(64,1,13,'Agua vital',1,3900,'S','2024-12-28'),(65,1,13,'Sahnenuss',1,9380,'S','2024-12-28'),(66,1,13,'Chocolate',1,13380,'S','2024-12-28'),(67,1,13,'Cereal bar fruta',1,3220,'S','2024-12-28'),(68,1,13,'Cereal bar Chocolate',1,3130,'S','2024-12-28'),(69,1,13,'Cereal Bar Miel',1,3220,'S','2024-12-28'),(70,1,13,'Coca cola zero',1,5600,'S','2024-12-28'),(71,1,13,'Papas Fritas Stax',1,11340,'S','2024-12-28'),(72,1,14,'',0,0,'S','2024-12-28'),(73,1,13,'Chocolate Trencito',1,8600,'S','2024-12-28'),(74,1,13,'Ramitas queso',1,10580,'S','2024-12-28'),(75,1,13,'Ramitas original',1,5690,'S','2024-12-28'),(76,1,13,'Galleta Toddy',1,10800,'S','2024-12-28'),(77,1,13,'Galleta Tuareg',1,5200,'S','2024-12-28'),(78,1,13,'Galleta Din Don',1,2750,'S','2024-12-28'),(79,1,13,'Galleta Mini Palmerita',1,1890,'S','2024-12-28'),(80,1,13,'Galleta Mantequilla',1,5440,'S','2024-12-28'),(81,1,13,'Lays Stax',1,6720,'S','2024-12-28'),(82,1,15,'KeGol',2,2710,'S','2024-12-31'),(83,1,15,'Alfajor Bon o Bon',2,13436,'S','2024-12-31'),(84,1,15,'Galleta Bon o Bon',2,6544,'S','2024-12-31'),(85,1,15,'Galleta Coco Costa',10,625,'S','2024-12-31'),(86,1,16,'',0,0,'S','2025-01-04'),(87,1,17,'',0,0,'S','2025-01-04'),(88,1,18,'Cachantún Citrus',1,2606,'S','2025-01-04'),(89,1,18,'Coca cola Oreo',1,4622,'S','2025-01-04'),(90,1,18,'Fanta lata 350',1,4622,'S','2025-01-04'),(91,1,18,'Sprite Ice 350',1,6471,'S','2025-01-04'),(92,1,19,'Mini Mega Sahnenuss',1,8655,'S','2025-01-04'),(93,1,19,'Mini Crocanty',1,11346,'S','2025-01-04'),(94,1,19,'Mini Trululú',1,4025,'S','2025-01-04'),(95,1,19,'Centella',1,3697,'S','2025-01-04'),(96,1,19,'Carbon',1,20806,'S','2025-01-04'),(97,1,19,'',0,0,'S','2025-01-04'),(98,1,20,'Carbon',1,20000,'S','2025-01-11'),(99,1,21,'',0,0,'S','2025-01-11'),(100,1,22,'Frac',2,2517,'S','2025-01-11'),(101,1,23,'',0,0,'S','2025-01-11'),(102,1,24,'Galleta dindon',1,2933,'S','2025-01-11'),(103,1,24,'Galleta Frac',2,2517,'S','2025-01-11'),(104,1,24,'Alfi',1,1341,'S','2025-01-11'),(105,1,22,'Din don',1,2933,'S','2025-01-11'),(106,1,22,'Alfi',1,6689,'S','2025-01-11'),(107,1,22,'',0,0,'N','2025-01-11'),(108,1,25,'Vital Sin Gas',1,6837,'S','2025-01-17'),(109,1,25,'Vital Con Gass',1,6837,'S','2025-01-17'),(110,1,25,'Coca cola en lata',1,7588,'S','2025-01-17'),(111,1,25,'Coca Cola Zero',1,7980,'S','2025-01-17'),(112,1,25,'Sprite',1,3390,'S','2025-01-17'),(113,1,26,'Vital Sin Gas',1,8564,'S','2025-01-17'),(114,1,26,'Vital Con Gas',1,8564,'S','2025-01-17'),(115,1,26,'Coca cola lata',1,9458,'S','2025-01-17'),(116,1,26,'Coca Cola Sin azucar',1,9924,'S','2025-01-17'),(117,1,26,'Sprite',1,5176,'S','2025-01-17'),(118,1,27,'',0,0,'S','2025-01-18'),(119,1,28,'Galleta Bon o BON',10,1002,'S','2025-01-18'),(120,1,28,'Galleta Bon o Bon Blanca',10,1002,'S','2025-01-18'),(121,1,28,'Donuts',10,960,'S','2025-01-18'),(122,1,28,'Koyak',2,1528,'S','2025-01-18'),(123,1,28,'Dulces Arbolito',2,3113,'S','2025-01-18'),(124,1,28,'Golazo',2,3830,'S','2025-01-18'),(125,1,28,'Galleta Niza',10,727,'S','2025-01-18'),(126,1,28,'Galleta Mantequilla',10,727,'S','2025-01-18'),(127,1,28,'Jugo Refreskids',1,3385,'S','2025-01-18'),(128,1,28,'Jugo Refreskids Manzana',1,3385,'S','2025-01-18'),(129,1,29,'Chocman',1,5760,'S','2025-01-22'),(130,1,29,'Chocman Black',1,6080,'S','2025-01-22'),(131,1,29,'Marshmallow Maximo',1,8060,'S','2025-01-22'),(132,1,29,'Bon o Bon',1,12100,'S','2025-01-22'),(133,1,29,'Marshmallows',1,3540,'S','2025-01-22'),(134,1,29,'Alfi alfajores',1,4380,'S','2025-01-22'),(135,1,29,'Gomitas Ambrosito',1,3770,'S','2025-01-22'),(136,1,29,'Gomitas Flipy',1,3770,'S','2025-01-22'),(137,1,29,'Kryzpo',1,6720,'S','2025-01-22'),(138,1,29,'Kryzpo',1,6720,'S','2025-01-22'),(139,1,29,'Galleta',1,7380,'S','2025-01-22'),(140,1,30,'',0,0,'S','2025-01-28'),(141,1,31,'Coca cola lata',1,9167,'S','2025-01-28'),(142,1,31,'Sprite lata',1,9167,'S','2025-01-28'),(143,1,31,'Fanta lata',1,9167,'S','2025-01-28'),(144,1,31,'Coca cola 1lt',1,9167,'S','2025-01-28'),(145,1,32,'',0,0,'S','2025-02-01'),(146,1,33,'',0,0,'S','2025-02-01'),(147,1,34,'Galletón Quaker',1,3700,'S','2025-02-01'),(148,1,34,'Galleton Quaker',1,3700,'S','2025-02-01'),(149,1,34,'De Todito Queso',1,11420,'S','2025-02-01'),(150,1,34,'Cheetos',1,10580,'S','2025-02-01'),(151,1,34,'Papas Fritas',1,9980,'S','2025-02-01'),(152,1,34,'Doritos Queso',1,5650,'S','2025-02-01'),(153,1,35,'Golazo',1,7660,'S','2025-02-07'),(154,1,35,'Galleta niza',1,7270,'S','2025-02-07'),(155,1,35,'Bonobon',1,5087,'S','2025-02-07'),(156,1,35,'Bonobon',1,5087,'S','2025-02-07'),(157,1,35,'Galleta Bon o bon',1,10020,'S','2025-02-07'),(158,1,35,'cocaditas',1,5645,'S','2025-02-07'),(159,1,36,'Bon o bon Blanco galleta',5,10000,'S','2025-08-28'),(160,1,37,'',0,0,'S','2025-08-28'),(161,1,38,'',0,0,'S','2025-08-28'),(162,1,39,'',0,0,'S','2025-08-28'),(163,1,40,'',0,0,'S','2025-08-28'),(164,1,40,'',0,0,'S','2025-08-28'),(165,1,41,'',0,0,'S','2025-08-28'),(166,1,42,'',0,0,'S','2025-08-28'),(167,1,42,'',0,0,'N','2025-08-28'),(168,1,43,'',0,0,'S','2025-08-28'),(169,1,44,'',0,0,'N','2025-08-28'),(170,1,45,'',0,0,'N','2025-08-28'),(171,1,45,'',0,0,'N','2025-08-28'),(172,1,45,'',0,0,'N','2025-08-28'),(173,1,45,'',0,0,'N','2025-08-28'),(174,1,45,'',0,0,'N','2025-08-28'),(175,1,45,'',0,0,'N','2025-08-28'),(176,1,44,'CD Los Bunkers',20,1200,'S','2025-08-28'),(177,1,44,'',0,0,'S','2025-08-28'),(178,1,46,'los bunkers',10,2500,'S','2025-09-24'),(179,1,47,'',0,0,'S','2025-09-24'),(180,1,48,'',0,0,'S','2025-09-24');
/*!40000 ALTER TABLE `pedidos_detalle` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-09-25 15:23:12
